<?xml version="1.0" encoding="ASCII"?>
<modullist>
    <modul>
        <name>3D-Rekonstruktion</name>
        <credits>5</credits>
        <sws>4</sws>
        <verantwortlich>schnoerrclaudius</verantwortlich>
        <teacher>schnoerrclaudius</teacher>
        <language>de</language>
        <lehrform>su-praktikum</lehrform>
        <aufwand>30 Pr&#228;senzstunden Vorlesung, 30 Pr&#228;senzstunden Praktikum, 45 Stunden Vor-/Nachbereitung des Praktikums, 45 Stunden Nachbereitung der Vorlesung und Pr&#252;fungsvorbereitung</aufwand>
        <voraussetzungen>Lineare Algebra (IF-I-B-103), Computergrafik und Bildverarbeitung (IF-I-B-601), Integraltransformationen (IF-I-B-303), Numerische Mathematik (IF-I-B-M02)\n#\n#N&#252;tzlich: Photogrammetrische Bildverarbeitung (IF-I-M505)</voraussetzungen>
        <ziele>.Kenntnis notwendiger Grundlagen, wesentlicher Ans&#228;tze als auch praktischer Verfahren, die f&#252;r den Aspekt '3D- bzw. Tiefeninformation' in Bildern spezifisch sind\n .die F&#228;higkeit, darauf aufsetzend Aufgaben einzuordnen und eigenst&#228;ndig L&#246;sungen zu erarbeiten, vom Konzept bis hin zu algorithmischen Umsetzungen\n .das Erreichen einer kritischen Urteilsf&#228;higkeit &#252;ber Konzepte sowie die Kompetenz, selbst wissenschaftlich neue Konzepte zu erarbeiten\n . </ziele>
        <inhalt>&#220;ber die Extraktion von 3D-Informationen aus mehreren unterschiedlichen Ansichten derselben Szene l&#228;&#223;t sich die Struktur einer Realweltszene computergest&#252;tzt erst verstehen. &#220;ber diese Verfahren erschlie&#223;en sich zahlreiche Anwendungsgebiete, z.B. die 3D-Qualit&#228;skontrolle in der Fertigung.\n#\n#Auszug aus der Gliederung:\n\n    .Einordnung, Anwendungsgebiete und Beispiele\n    .Euklidische Bewegungen (Objekt- u. Kamerabewegung, Koordinatentransformationen)\n    .projektive Geometrie (u.a. perspektivische Projektion, Repr&#228;sentation und Sch&#228;tzung geometrischer Bildprimitive)\n    .projektive Transformationen und Invarianz (u.a. Transformationsgruppen, Rekonstruktion affiner und metrischer Bildeigenschaften)\n    .Projektion und Kameras (u.a. spezielle Kameras, Selbstkalibrierung)\n    .Epipolargeometrie und Geometrie mehrfacher Ansichten\n    .Sch&#228;tzen von Transformationen und Korrespondenzen (u.a. Kameramatrix, Kalibrierung, Entzerrung)\n    .Stereoanalyse\n    .3D-Rekonstruktion</inhalt>
        <medien>Tafel, Beamer, selbstgesteuertes Lernen in Kleingruppen, Praktikum in Matlab oder Mathematica</medien>
        <literatur>.Multiple View Geometry in Computer Vision, R. Hartley, A. Zisserman, Cambridge Univ. Press, 2000\n .Stereoanalyse und Bildsynthese, O.Schreer, Springer, 2005\n . </literatur>
        <program/>
        <modulcodes>
            <modulcode>
                <modul>3drekonstruktion</modul>
                <regulation>if20121001</regulation>
                <angebot>einzeln</angebot>
                <leistungen>sa40sp60</leistungen>
                <code>IF-I-B-F68</code>
                <semester>4</semester>
                <semester>6</semester>
                <semester>7</semester>
                <curriculum>Freiwilliges Wahlpflichtfach im Bachelor Informatik</curriculum>
            </modulcode>
            <modulcode>
                <modul>3drekonstruktion</modul>
                <regulation>ig19700101</regulation>
                <angebot>wechsel</angebot>
                <leistungen>sa40mp60</leistungen>
                <code>IG-CGB-0010</code>
                <semester>2</semester>
                <curriculum>CGBV: Schwerpunkt Vertiefung #EC: Fachliche Profilbildung #SWE: Fachliche Profilbildung</curriculum>
            </modulcode>
        </modulcodes>
        <code>IF-I-B-F68, IG-CGB-0010</code>
    </modul>
    <modul>
        <name>3D-Szenengenerierung</name>
        <credits>5</credits>
        <sws>4</sws>
        <verantwortlich>nischwitzalfred</verantwortlich>
        <teacher>fischermax</teacher>
        <teacher>nischwitzalfred</teacher>
        <language>de</language>
        <language>en</language>
        <lehrform>su-praktikum</lehrform>
        <aufwand>30 Pr&#228;senzstunden Vorlesung, 30 Pr&#228;senzstunden Praktikum, 45 Stunden Vor-/Nachbereitung des Praktikums, 45 Stunden Nachbereitung der Vorlesung und Pr&#252;fungsvorbereitung</aufwand>
        <voraussetzungen>Empfohlen: Computergrafik (IF-I-M001)</voraussetzungen>
        <ziele>Kennen und Verstehen der wichtigsten Konzepte, Algorithmen und Verfahren der 3D-Szenengenerierung. F&#228;higkeit, die wichtigsten Problemstellungen der 3D-Szenengenerierung zu klassifizieren und Programme zu deren L&#246;sung selbst zu entwickeln. F&#228;higkeit zur Teamarbeit.</ziele>
        <inhalt>Modellieren geometrischer Objekte, Parameterkurven, B&#233;zier-Kurven, Splines, Parametrische Fl&#228;chen, Polygonale Netze, Tessellierung und Triangulation, Konstruktion von Dreiecksnetzen, Ausd&#252;nnung von polygonalen Netzen (Level-Of-Detail), Prozedurale und fraktale Modellierung, Physically Based Modelling, Effiziente 3D-Szenen-Modellierung f&#252;r Echtzeit-Rendering (Ber&#252;cksichtigung spezieller Datenstrukturen von Rendering-APIs).</inhalt>
        <medien>Beamer, Tafel, Demonstrationen mit Hilfe von 3D-Szenengenerierwerkzeugen wie z.B. 3D Studio Max und OpenGL-Programmbeispielen.</medien>
        <literatur>A. Nischwitz, M. Fischer, G.Socher, P. Haber&#228;cker: Computergrafik und Bildverarbeitung, Vieweg-Teubner, aktuelle Ausgabe. #\nT. Akenine-M&#246;ller, E. Haines: Real-Time Rendering, A K Peters, aktuelle Ausgabe. #\nM. Bender, M. Brill: Computergrafik, Hanser, aktuelle Ausgabe.</literatur>
        <program/>
        <modulcodes>
            <modulcode>
                <modul>3dszenengenerierung</modul>
                <regulation>ig19700101</regulation>
                <angebot>wechsel</angebot>
                <leistungen>sa40sp60</leistungen>
                <code>IG-CGB-0020</code>
                <semester>2</semester>
                <curriculum>CGBV: Schwerpunkt #EC: Fachliche Profilbildung #SWE: Fachliche Profilbildung</curriculum>
            </modulcode>
        </modulcodes>
        <code>IG-CGB-0020</code>
    </modul>
    <modul>
        <name>Advanced Embedded Software Projekt</name>
        <credits>5</credits>
        <sws>4</sws>
        <verantwortlich>fischermax</verantwortlich>
        <teacher>barkerron</teacher>
        <teacher>fischermax</teacher>
        <teacher>orehekmartin</teacher>
        <language>de</language>
        <lehrform>projekt</lehrform>
        <aufwand>60 Pr&#228;senzstunden, 90 Stunden Vor-/Nachbereitung\ninklusive Erstellung der Projektarbeit und Referat</aufwand>
        <voraussetzungen>Programmierkenntnisse in C/C++</voraussetzungen>
        <ziele>. Die F&#228;higkeit, Anwendungssoftware und Firmware f&#252;r eingebettete Systeme im Rahmen einer aktuellen Themenstellung aus diesem Gebiet auszuw&#228;hlen, leitend in einem Team zu entwerfen, zu realisieren und zu testen.\n. Die F&#228;higkeit zur Modellierung und Implementierung von Anwendungssoftware und Firmware auf ressourcenbeschr&#228;nkter Hardware, je nach Anwendungsfall die Auswahl sowie Inbetriebnahme geeigneter Betriebssysteme bzw. Board Support Packages\n. Die Kompetenz, im fortschrittlichen Umfeld von Embedded Software Projekte federf&#252;hrend zu organisieren und durchzuf&#252;hren sowie Projektteams anzuleiten.</ziele>
        <inhalt>Je nach Projektziel wird Software f&#252;r ein fortschrittliches eingebettetes System auf vorgegebener, ressourcen- beschr&#228;nkter Hardware in Form eines gemeinsamen Projekts entworfen und implementiert. Dabei sind aktuelle, erforderliche Entwicklungsumgebungen (z.B. Embedded OS, IDEs und Umgebungen f&#252;r Test, Debugging, Host-Target-Entwicklung etc.) zu recherchieren und auszuw&#228;hlen.\n# Die Organisation und Abwicklung des Projekts wird federf&#252;hrend von den Teilnehmern durchgef&#252;hrt.\n# Die Teilnehmer stellen in Referaten die erarbeiteten Teilaspekte des Projekts vor.</inhalt>
        <medien>Tafel, Folien oder Beamer</medien>
        <literatur>Themenspezifische Literatur abh&#228;ngig vom konkreten\nProjekt, &#8222;Moderne Realzeitsysteme entwickeln&#8220;, Quade,\nJ., M&#228;chtel, M, Dpunkt Verlag, Heidelberg 2012</literatur>
        <program>ig</program>
        <modulcodes>
            <modulcode>
                <modul>advancedembeddedsoftwareprojekt</modul>
                <regulation>ig19700101</regulation>
                <angebot>einzeln</angebot>
                <leistungen>p60r40</leistungen>
                <code>IG-THI-0010</code>
                <semester>1</semester>
                <semester>2</semester>
                <curriculum>CGBV: Fachliche Profilbildung #EC: Schwerpunkt #SWE: Fachliche Profilbildung</curriculum>
            </modulcode>
        </modulcodes>
        <code>IG-THI-0010</code>
    </modul>
    <modul>
        <name>Aktuelle Forschungsprojekte in der Wirtschaftsinformatik</name>
        <credits>5</credits>
        <sws>4</sws>
        <verantwortlich>mandlpeter</verantwortlich>
        <teacher>lindermeierrobert</teacher>
        <teacher>mandlpeter</teacher>
        <language>de</language>
        <language>en</language>
        <lehrform>seminar</lehrform>
        <aufwand>Pr&#228;senzstudium: ca. 42 Std., Eigenstudium: ca. 108 Std.</aufwand>
        <voraussetzungen>Umfassende Kenntnisse der Wirtschaftsinformatik, entsprechend Abschluss Bachelor Wirtschaftsinformatik</voraussetzungen>
        <ziele>~Lernziele:~ Verstehen ausgew&#228;hlter, aktueller Forschungsprobleme der Wirtschaftsinformatik und den damit verbundenen wissenschaftstheoretischen Ans&#228;tzen bzw. Forschungsmethoden.\n#\n~Kompetenzen:~ Problem- und l&#246;sungsorientiertes Denken, wissenschaftliches Ar-beiten mit Quellen, Verfassen wissenschaftlicher Arbeiten, ethisch ordnungsgem&#228;&#223;es Gewinnen und Darstellen wissenschaftlicher Ergebnisse.</ziele>
        <inhalt>Einf&#252;hrung in ausgew&#228;hlte, aktuelle Forschungsprojekte der Wirtschaftsinformatik, damit verbundener Fragestellungen und zugrundeliegenden theoretischen Konzepten.\n#\nAufarbeiten von Teilprojektaspekten f&#252;r konkrete\nlaufende Projekte und Promotionsvorhaben im Eigenstudium.\nEinarbeitung in die Grundlagen des gew&#228;hlten Forschungsbereichs, Eingrenzung der Forschungsthematik, Auswahl geeigneter Forschungsmethoden, wissenschaftliche Bearbeitung ausgew&#228;hlter Forschungsthemen, Darstellung und Disputation der Ergebnisse.\n#\nEine Ver&#246;ffentlichung relevanter Ergebnisse wird gef&#246;rdert.</inhalt>
        <medien>Multimediale Pr&#228;sentationen, Selbstgesteuerte Lernformen, Fallstudien, Allgemeine Informationen (Hinweise im WWW), B&#252;cher, Zeitschriftenartikel und Tagungsb&#228;nde, Software, Internet</medien>
        <literatur>.Rechenberg, P.: Technisches Schreiben, 2. erweiterte Auflage,\nHanser Verlag, 2006\n\n.Literaturauswahl je nach Forschungsprojekt aus B&#252;chern, Zeit-schriftenartikeln und Tagungsb&#228;nden.\n\n.IEEE XPLORE: http://ieeexplore.ieee.org\n.ACM Digital Library: http://www.acm.org/\n.</literatur>
        <program>in</program>
        <modulcodes>
            <modulcode>
                <modul>aktuelleforschungsprojekteinderwirtschaftsinformatik</modul>
                <regulation>ig19700101</regulation>
                <angebot>einzeln</angebot>
                <leistungen>sa40kol60</leistungen>
                <code>IG-TTI-0010</code>
                <semester>1</semester>
                <semester>2</semester>
                <curriculum>CGBV: Fachliche Profilbildung #EC: Fachliche Profilbildung #SWE: Fachliche Profilbildung</curriculum>
            </modulcode>
            <modulcode>
                <modul>aktuelleforschungsprojekteinderwirtschaftsinformatik</modul>
                <regulation>in19700101</regulation>
                <angebot>einzeln</angebot>
                <leistungen>sa40kol60</leistungen>
                <code>IF-WI-M-13-15-7</code>
                <semester>1</semester>
                <semester>2</semester>
                <curriculum>FWP Fach</curriculum>
            </modulcode>
        </modulcodes>
        <code>IG-TTI-0010, IF-WI-M-13-15-7</code>
    </modul>
</modullist>